(function() {
    var locale = {
  weekdays: {
    shorthand: [
      "یەکشەممە",
      "دووشەممە",
      "سێشەممە",
      "چوارشەممە",
      "پێنجشەممە",
      "هەینی",
      "شەممە",
    ],
    longhand: [
      "یەکشەممە",
      "دووشەممە",
      "سێشەممە",
      "چوارشەممە",
      "پێنجشەممە",
      "هەینی",
      "شەممە",
    ],
  },

  months: {
    shorthand: [
      "ڕێبەندان",
      "ڕەشەمە",
      "نەورۆز",
      "گوڵان",
      "جۆزەردان",
      "پووشپەڕ",
      "گەلاوێژ",
      "خەرمانان",
      "ڕەزبەر",
      "گەڵاڕێزان",
      "سەرماوەز",
      "بەفرانبار",
    ],
    longhand: [
      "ڕێبەندان",
      "ڕەشەمە",
      "نەورۆز",
      "گوڵان",
      "جۆزەردان",
      "پووشپەڕ",
      "گەلاوێژ",
      "خەرمانان",
      "ڕەزبەر",
      "گەڵاڕێزان",
      "سەرماوەز",
      "بەفرانبار",
    ],
  },
  firstDayOfWeek: 6,
  ordinal: () => {
    return "";
  },
};
    
    if (typeof window !== "undefined" && window.flatpickr !== undefined) {
        window.flatpickr.localize(window.flatpickr.l10ns.ckb = locale);
    }
})();